
## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/87706805/runs/6582d60b-f974-4185-885c-374e173a66ed).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>

## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
~   update in-place

Terraform will perform the following actions:

  # module.launch_vm["avq-test-01"].proxmox_virtual_environment_vm.server will be updated in-place
~   resource "proxmox_virtual_environment_vm" "server" {
        id                      = "103"
        name                    = "avq-test-01"
        tags                    = []
        # (30 unchanged attributes hidden)
~
       disk {
~           size              = 20 -> 30
            # (14 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.launch_vm["avq-test-02"].proxmox_virtual_environment_vm.server will be updated in-place
~   resource "proxmox_virtual_environment_vm" "server" {
        id                      = "102"
        name                    = "avq-test-02"
        tags                    = []
        # (30 unchanged attributes hidden)
~
       disk {
~           size              = 20 -> 30
            # (14 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.launch_vm["avq-test-03"].proxmox_virtual_environment_vm.server will be updated in-place
~   resource "proxmox_virtual_environment_vm" "server" {
        id                      = "101"
        name                    = "avq-test-03"
        tags                    = []
        # (30 unchanged attributes hidden)
~
       disk {
~           size              = 20 -> 30
            # (14 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.launch_vm["avq-test-04"].proxmox_virtual_environment_vm.server will be created
+   resource "proxmox_virtual_environment_vm" "server" {
+       acpi                    = true
+       bios                    = "seabios"
+       id                      = (known after apply)
+       ipv4_addresses          = (known after apply)
+       ipv6_addresses          = (known after apply)
+       keyboard_layout         = "en-us"
+       mac_addresses           = (known after apply)
+       migrate                 = false
+       name                    = "avq-test-04"
+       network_interface_names = (known after apply)
+       node_name               = "frodo"
+       on_boot                 = true
+       protection              = false
+       reboot                  = false
+       reboot_after_update     = true
+       scsi_hardware           = "virtio-scsi-pci"
+       started                 = true
+       stop_on_destroy         = true
+       tablet_device           = true
+       template                = false
+       timeout_clone           = 1800
+       timeout_create          = 1800
+       timeout_migrate         = 1800
+       timeout_move_disk       = 1800
+       timeout_reboot          = 1800
+       timeout_shutdown_vm     = 1800
+       timeout_start_vm        = 1800
+       timeout_stop_vm         = 300
+       vm_id                   = (known after apply)
+
       cpu {
+           cores      = 2
+           hotplugged = 0
+           limit      = 0
+           numa       = false
+           sockets    = 1
+           type       = "qemu64"
+           units      = 1024
        }
+
       disk {
+           aio               = "io_uring"
+           backup            = true
+           cache             = "none"
+           datastore_id      = "local-lvm"
+           discard           = "on"
+           file_format       = (known after apply)
+           file_id           = "local:iso/noble-server-cloudimg-amd64.qcow2.img"
+           interface         = "virtio0"
+           iothread          = true
+           path_in_datastore = (known after apply)
+           replicate         = true
+           size              = 30
+           ssd               = false
        }
+
       initialization {
+           datastore_id         = "local-lvm"
+           meta_data_file_id    = (known after apply)
+           network_data_file_id = (known after apply)
+           type                 = (known after apply)
+           user_data_file_id    = (known after apply)
+           vendor_data_file_id  = (known after apply)
+
           ip_config {
+               ipv4 {
+                   address = "192.168.51.33/24"
+                   gateway = "192.168.51.1"
                }
            }
+
           user_account {
+               password = (sensitive value)
+               username = (sensitive value)
            }
        }
+
       memory {
+           dedicated      = 1024
+           floating       = 0
+           keep_hugepages = false
+           shared         = 0
        }
+
       network_device {
+           bridge      = "vmbr0"
+           enabled     = true
+           firewall    = false
+           mac_address = (known after apply)
+           model       = "virtio"
+           mtu         = 0
+           queues      = 0
+           rate_limit  = 0
+           vlan_id     = (sensitive value)
        }
+
       vga (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Changes to Outputs:
~   guest_name = [
        # (2 unchanged elements hidden)
        "avq-test-03",
+       "avq-test-04",
    ]

```

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>